; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v8 ?v5)
             (pred_4 ?v11 ?v1)
             (pred_11 ?v8 ?v1)
             (pred_12 ?v10 ?v8 )
	     (pred_6 ?v8)
             (pred_9 ?v9)
             (pred_5 ?v11)
             (pred_2 ?v1)
             (pred_1 ?v8)
             (pred_10 ?v11)
             (pred_3 ?v8)
             (pred_8 ))



(:action op_2
:parameters (?v7 ?v12 ?v4 ?v3)
:precondition (and (pred_9 ?v7) (pred_9 ?v12) (pred_5 ?v4) (pred_2 ?v3)
          (pred_7 ?v7 ?v12) (pred_4 ?v4 ?v3)
                   (pred_11 ?v12 ?v3) (pred_6 ?v7) 
                   (pred_1 ?v12) (pred_10 ?v4))
:effect (and  (pred_3 ?v12) (not (pred_1 ?v12))))


(:action op_5
:parameters (?v7 ?v2)
:precondition (and (pred_9 ?v7) (pred_9 ?v2)
               (pred_6 ?v7) (pred_7 ?v7 ?v2) (pred_3 ?v2))
:effect (and (pred_6 ?v2) (not (pred_6 ?v7))))

(:action op_1
:parameters (?v7 ?v4)
:precondition (and (pred_9 ?v7) (pred_5 ?v4) 
                  (pred_6 ?v7) (pred_12 ?v4 ?v7) (pred_8 ))
:effect (and (pred_10 ?v4)
   (not (pred_12 ?v4 ?v7)) (not (pred_8 ))))


(:action op_3
:parameters (?v7 ?v13 ?v6)
:precondition (and (pred_9 ?v7) (pred_5 ?v13) (pred_5 ?v6)
                  (pred_6 ?v7) (pred_10 ?v6) (pred_12 ?v13 ?v7))
:effect (and (pred_10 ?v13) (pred_12 ?v6 ?v7)
        (not (pred_10 ?v6)) (not (pred_12 ?v13 ?v7))))

(:action op_4
:parameters (?v7 ?v4)
:precondition (and (pred_9 ?v7) (pred_5 ?v4) 
                  (pred_6 ?v7) (pred_10 ?v4))
:effect (and (pred_8 ) (pred_12 ?v4 ?v7) (not (pred_10 ?v4)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_22 obj_18 obj_25 obj_21 obj_24 obj_27 obj_16 obj_11 obj_05 obj_26 obj_30 obj_23 obj_28 obj_15 obj_08 obj_01 obj_17 obj_19 obj_14 obj_03 obj_29 obj_09 obj_02 obj_06 obj_12
    obj_10 obj_07
    obj_04 obj_20 obj_13
    )

    (:init
       (pred_8)

       (pred_9 obj_22)
       (pred_9 obj_18)
       (pred_9 obj_25)
       (pred_9 obj_21)
       (pred_9 obj_24)
       (pred_9 obj_27)
       (pred_9 obj_16)
       (pred_9 obj_11)
       (pred_9 obj_05)
       (pred_9 obj_26)
       (pred_9 obj_30)
       (pred_9 obj_23)
       (pred_9 obj_28)
       (pred_9 obj_15)
       (pred_9 obj_08)
       (pred_9 obj_01)
       (pred_9 obj_17)
       (pred_9 obj_19)
       (pred_9 obj_14)
       (pred_9 obj_03)
       (pred_9 obj_29)
       (pred_9 obj_09)
       (pred_9 obj_02)
       (pred_9 obj_06)
       (pred_9 obj_12)
       (pred_2 obj_10)
       (pred_2 obj_07)
       (pred_5 obj_04)
       (pred_5 obj_20)
       (pred_5 obj_13)

       (pred_7 obj_22 obj_27)
       (pred_7 obj_22 obj_18)
       (pred_7 obj_18 obj_16)
       (pred_7 obj_18 obj_25)
       (pred_7 obj_18 obj_22)
       (pred_7 obj_25 obj_11)
       (pred_7 obj_25 obj_21)
       (pred_7 obj_25 obj_18)
       (pred_7 obj_21 obj_05)
       (pred_7 obj_21 obj_24)
       (pred_7 obj_21 obj_25)
       (pred_7 obj_24 obj_26)
       (pred_7 obj_24 obj_21)
       (pred_7 obj_27 obj_30)
       (pred_7 obj_27 obj_16)
       (pred_7 obj_27 obj_22)
       (pred_7 obj_16 obj_23)
       (pred_7 obj_16 obj_11)
       (pred_7 obj_16 obj_18)
       (pred_7 obj_16 obj_27)
       (pred_7 obj_11 obj_28)
       (pred_7 obj_11 obj_05)
       (pred_7 obj_11 obj_25)
       (pred_7 obj_11 obj_16)
       (pred_7 obj_05 obj_15)
       (pred_7 obj_05 obj_26)
       (pred_7 obj_05 obj_21)
       (pred_7 obj_05 obj_11)
       (pred_7 obj_26 obj_08)
       (pred_7 obj_26 obj_24)
       (pred_7 obj_26 obj_05)
       (pred_7 obj_30 obj_01)
       (pred_7 obj_30 obj_23)
       (pred_7 obj_30 obj_27)
       (pred_7 obj_23 obj_17)
       (pred_7 obj_23 obj_28)
       (pred_7 obj_23 obj_16)
       (pred_7 obj_23 obj_30)
       (pred_7 obj_28 obj_19)
       (pred_7 obj_28 obj_15)
       (pred_7 obj_28 obj_11)
       (pred_7 obj_28 obj_23)
       (pred_7 obj_15 obj_14)
       (pred_7 obj_15 obj_08)
       (pred_7 obj_15 obj_05)
       (pred_7 obj_15 obj_28)
       (pred_7 obj_08 obj_03)
       (pred_7 obj_08 obj_26)
       (pred_7 obj_08 obj_15)
       (pred_7 obj_01 obj_29)
       (pred_7 obj_01 obj_17)
       (pred_7 obj_01 obj_30)
       (pred_7 obj_17 obj_09)
       (pred_7 obj_17 obj_19)
       (pred_7 obj_17 obj_23)
       (pred_7 obj_17 obj_01)
       (pred_7 obj_19 obj_02)
       (pred_7 obj_19 obj_14)
       (pred_7 obj_19 obj_28)
       (pred_7 obj_19 obj_17)
       (pred_7 obj_14 obj_06)
       (pred_7 obj_14 obj_03)
       (pred_7 obj_14 obj_15)
       (pred_7 obj_14 obj_19)
       (pred_7 obj_03 obj_12)
       (pred_7 obj_03 obj_08)
       (pred_7 obj_03 obj_14)
       (pred_7 obj_29 obj_09)
       (pred_7 obj_29 obj_01)
       (pred_7 obj_09 obj_02)
       (pred_7 obj_09 obj_17)
       (pred_7 obj_09 obj_29)
       (pred_7 obj_02 obj_06)
       (pred_7 obj_02 obj_19)
       (pred_7 obj_02 obj_09)
       (pred_7 obj_06 obj_12)
       (pred_7 obj_06 obj_14)
       (pred_7 obj_06 obj_02)
       (pred_7 obj_12 obj_03)
       (pred_7 obj_12 obj_06)
       (pred_1 obj_25)
       (pred_1 obj_16)
       (pred_1 obj_27)
       (pred_11  obj_25 obj_10)
       (pred_11  obj_16 obj_07)
       (pred_11  obj_27 obj_10)
       (pred_3 obj_22)
       (pred_3 obj_18)
       (pred_3 obj_21)
       (pred_3 obj_24)
       (pred_3 obj_11)
       (pred_3 obj_05)
       (pred_3 obj_26)
       (pred_3 obj_30)
       (pred_3 obj_23)
       (pred_3 obj_28)
       (pred_3 obj_15)
       (pred_3 obj_08)
       (pred_3 obj_01)
       (pred_3 obj_17)
       (pred_3 obj_19)
       (pred_3 obj_14)
       (pred_3 obj_03)
       (pred_3 obj_29)
       (pred_3 obj_09)
       (pred_3 obj_02)
       (pred_3 obj_06)
       (pred_3 obj_12)

       (pred_4  obj_04 obj_10)
       (pred_4  obj_20 obj_07)
       (pred_4  obj_13 obj_07)
       (pred_12 obj_04 obj_28)
       (pred_12 obj_20 obj_02)
       (pred_12 obj_13 obj_03)
       (pred_6 obj_09)
    )

    (:goal (and
       (pred_12 obj_20 obj_08)
    ))
(:constraints
  (always (not (pred_6 obj_19)))
)
)

; plan
1. (op_5 obj_09 obj_02)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_02)
   goals met: 0 of 1
2. (op_1 obj_02 obj_20)
   deleted: (pred_12 obj_20 obj_02) (pred_8)
   added: (pred_10 obj_20)
   goals met: 0 of 1
3. (op_5 obj_02 obj_06)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_06)
   goals met: 0 of 1
4. (op_5 obj_06 obj_14)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_14)
   goals met: 0 of 1
5. (op_5 obj_14 obj_15)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_15)
   goals met: 0 of 1
6. (op_5 obj_15 obj_08)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_08)
   goals met: 0 of 1
7. (op_4 obj_08 obj_20)
   deleted: (pred_10 obj_20)
   added: (pred_8) (pred_12 obj_20 obj_08)
   goals met: 1 of 1
